src/Catalogs/ШаблоныДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныДоговоров</Name>
			<Comment>Шаблоны договоров</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляАвтозаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЗаменяемойСтроки</Name>
							<Comment>Тип заменяемой строки является параметром ?</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемоеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияЗамены</Name>
							<Comment>Тип значения замены вычисляемое выражение ?</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗамены</Name>
							<Comment>Реквизит владельца файла, значение которого подставляется вместо заменяемого значения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЗначенияЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРеквизитаЗамены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаменыПустогоЗначения</Name>
							<Comment>Тип замены пустого значения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗаменыНезаполненного</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСимволовПрочерков</Name>
							<Comment>Количество символов прочерков</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭЦП</Name>
					<Comment>Файл подписан ЭЦП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияНомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРасширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияТом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипХраненияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СертификатыШифрования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныДоговоров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, "При создании на сервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если  ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти      

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ВыборШаблона, ТекущаяСтрока, РежимВыбора", Истина, Объект.ШаблонФайла, Истина);
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаВыбора"
//
Процедура ШаблонОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "ТекущаяВерсияРасширение");
	Если РасширениеФайла = "" Тогда
		РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "Расширение");
	КонецЕсли;
	ЕстьТерДляЗамены = НЕ (РасширениеФайла = "txt" ИЛИ РасширениеФайла = "html" ИЛИ РасширениеФайла = "htm");
	
	Счетчик = 0;
	Пока Счетчик <= Объект.ДанныеДляАвтозаполнения.Количество() - 1 И НЕ ЕстьТерДляЗамены цикл
		Если ЗначениеЗаполнено(Объект.ДанныеДляАвтозаполнения[Счетчик].ТермДляЗамены) Тогда
			Объект.ДанныеДляАвтозаполнения.Удалить(Счетчик);
			Счетчик = Счетчик - 1;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура ДанныеДляАвтозаполненияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.ШаблонФайла) Тогда
		ТекстСообщения = "Поле ""Шаблон файла"" не заполнено" ;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '" + ТекстСообщения + "'"),, "Объект.ШаблонФайла", ,Отказ);
	КонецЕсли;
	
	Если Отказ <> Истина Тогда
		ПараметрыОткрытияФормы = Новый Структура("ТипЗаменяемойСтроки, ЗаменяемоеЗначение, ТипЗначенияЗамены, ЗначениеЗамены, ФорматЗначенияЗамены, ТипРеквизитаЗамены, КэшСписокаПолей, ШаблонФайла, ТипЗаменыПустогоЗначения, ЗначениеЗаменыНезаполненного, КоличествоСимволовПрочерков");
		ПараметрыОткрытияФормы.КэшСписокаПолей = КэшСписокаПолей;
		ПараметрыОткрытияФормы.ШаблонФайла = Объект.ШаблонФайла;
		Если Копирование Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Элементы.ДанныеДляАвтозаполнения.ТекущиеДанные);
		КонецЕсли;
		ОткрытьФорму("Справочник.ШаблоныДоговоров.Форма.ФормаНастройкиЗамены", ПараметрыОткрытияФормы,,,,,Новый ОписаниеОповещения("ФормаНастройкиЗаменыЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ФормаНастройкиЗаменыЗавершение"
//
Процедура ФормаНастройкиЗаменыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
		Если Результат <> Неопределено Тогда
			НоваяСтрока = Объект.ДанныеДляАвтозаполнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			Результат.Свойство("КэшСписокаПолей", КэшСписокаПолей);
			Модифицированность = Истина;
		КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ПроверитьПравило"
//
Процедура ПроверитьПравило(Команда)
	
	#Если ВебКлиент Тогда
		
		Сообщение = "При использовании web-клиента нельзя осуществлять проверку правил.";		
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Возврат;
		
	#Иначе

		ОткрытьФорму("Документ.Договоры.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ПроверитьПравилоЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПроверитьПравилоЗавершение"
//
Процедура ПроверитьПравилоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	#Если НЕ ВебКлиент Тогда
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Выполняется заполнение шаблона файла. Пожалуйста, подождите...'"));
		
		РезультатЗаполненияФайла = АвтозаполнениеШаблоновФайловКлиент.ВыполнитьАвтоЗаполнениеШаблона(Результат, Объект);
		
		Если РезультатЗаполненияФайла.Результат = Истина Тогда
			ПутьКФайлу = ПолучитьИмяВременногоФайла(РезультатЗаполненияФайла.РасширениеФайла);
			РезультатЗаполненияФайла.ДвоичныеДанныеЗаполненногоФайла.Записать(ПутьКФайлу);
			ЗапуститьПриложение(ПутьКФайлу);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗаполненияФайла.ОписаниеОшибки);
		КонецЕсли;
		
		Состояние(); 
	#КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДобавитьВсеПоля"
//
Процедура ДобавитьВсеПоля(Команда)
		
	ПоказатьВопрос(Новый ОписаниеОповещения("ДобавитьВсеПоляЗавершение", ЭтотОбъект), 
	"Очистить таблицу правил перед добавлением?", РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить все поля завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ДобавитьВсеПоляЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ДанныеДляАвтозаполнения.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолей = ВернутьСписокПолейВФайле(Ложь);
	Для Каждого ЭлементМассива Из МассивПолей Цикл
		НоваяСтрока = Объект.ДанныеДляАвтозаполнения.Добавить();
		НоваяСтрока.ТипЗаменяемойСтроки = Истина;
		НоваяСтрока.ЗаменяемоеЗначение = ЭлементМассива;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
 // Функция получает и возвращает список полей в файле.
//
Функция ВернутьСписокПолейВФайле(ИзКэша = Истина)
	
	СписокПолей = Новый Массив;
	
	Если Объект.ШаблонФайла.Пустая() Тогда
		Возврат СписокПолей;
	КонецЕсли;	
	
	РасширениеФайла = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ШаблонФайла, "ТекущаяВерсияРасширение");
	ДвоичныеДанныеФайла = АвтозаполнениеШаблоновФайловСервер.ПолучитьДвоичныеДанныеФайла(Объект.ШаблонФайла);
	
	Если ИзКэша = Истина И КэшСписокаПолей.Количество() > 0 Тогда
		
		СписокПолей = КэшСписокаПолей.ВыгрузитьЗначения();
	
	ИначеЕсли РасширениеФайла = "odt" Тогда
		
		СписокПолей = АвтозаполнениеШаблоновФайловКлиент.НайтиВсеПоляВФайлеOpenOfficeWriter(РасширениеФайла, ДвоичныеДанныеФайла);
		
		КэшСписокаПолей.Очистить();
		КэшСписокаПолей.ЗагрузитьЗначения(СписокПолей);
		
	ИначеЕсли РасширениеФайла = "doc" ИЛИ РасширениеФайла = "dot" ИЛИ РасширениеФайла = "docx" ИЛИ РасширениеФайла = "dotx" Тогда
		
		СписокПолей = АвтозаполнениеШаблоновФайловКлиент.НайтиВсеПоляВФайлеMSWord(РасширениеФайла, ДвоичныеДанныеФайла);
		
		КэшСписокаПолей.Очистить();
		КэшСписокаПолей.ЗагрузитьЗначения(СписокПолей);
		
	КонецЕсли;
	
	Возврат СписокПолей;
	
КонецФункции

&НаКлиенте
Процедура ДанныеДляАвтозаполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ПараметрыОткрытияФормы = Новый Структура("ТипЗаменяемойСтроки, ЗаменяемоеЗначение, ТипЗначенияЗамены, ЗначениеЗамены, ФорматЗначенияЗамены, ТипРеквизитаЗамены, КэшСписокаПолей, ШаблонФайла, ТипЗаменыПустогоЗначения, ЗначениеЗаменыНезаполненного, КоличествоСимволовПрочерков");
	ПараметрыОткрытияФормы.КэшСписокаПолей = КэшСписокаПолей;
	ПараметрыОткрытияФормы.ШаблонФайла = Объект.ШаблонФайла;
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Элементы.ДанныеДляАвтозаполнения.ТекущиеДанные);
	ОткрытьФорму("Справочник.ШаблоныДоговоров.Форма.ФормаНастройкиЗамены", ПараметрыОткрытияФормы,,,,,Новый ОписаниеОповещения("ДанныеДляАвтозаполненияВыборЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДанныеДляАвтозаполненияВыборЗавершение"
//
Процедура ДанныеДляАвтозаполненияВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Элементы.ДанныеДляАвтозаполнения.ТекущиеДанные, Результат);
		Результат.Свойство("КэшСписокаПолей", КэшСписокаПолей);
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляАвтозаполненияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	НоваяСтрока = Объект.ДанныеДляАвтозаполнения.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйОбъект);
	НовыйОбъект.Свойство("КэшСписокаПолей", КэшСписокаПолей);
	
	Модифицированность = Истина;
		
КонецПроцедуры

#КонецОбласти
